hectororviz/esp32-KB/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_BT_ENABLED=y
CONFIG_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BLE_SMP_ENABLE=y

CONFIG_TINYUSB_ENABLED=y

CONFIG_PM_ENABLE=y

CONFIG_MAIN_TASK_STACK_SIZE=4096
